from math import sqrt
import matplotlib.pyplot as plt
import networkx as nx

Leo = nx.Graph()
Vertices_leo = ['α','β','γ','δ','ι','λ','ζ','κ','ρ','31','θ','ε','ο','µ','η','σ']
Leo.add_nodes_from(Vertices_leo)
Aristas_leo = [('β','δ'),('δ','θ'),('δ','γ'),('θ','ι'),('θ','η'),('θ','ρ'),('ι','σ'),('γ','ζ'),('ζ','µ'),('η','α'),
               ('η','ε'),('η','ο'),('α','31'),('µ','ε'),('µ','κ'),('ε','λ'),('κ','λ')]
Leo.add_edges_from(Aristas_leo)

ubica6={'α':(6.85,1.8),'β':(0.15,2.75),'γ':(6.1,3.9),'δ':(2.75,4.2),'ι':(1.8,1.5),'λ':(9.1,4.9),'ζ':(6.3,4.8),'κ':(9.45,5.75),'ρ':(5.25,1.05),'31':(6.8,1.25),'θ':(2.6,2.8),
       'ε':(8.2,4.95),'ο':(8.7,1.25),'µ':(7.7,5.55),'η':(6.9,3.05),'σ':(1.9,0.2)}

nx.draw(Leo, pos=ubica6, node_color='goldenrod', edge_color='black', with_labels=True)

plt.show()